tmp.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:afa="https://www.algosec.com/afa-ws">
   <soapenv:Header/>
   <soapenv:Body>
      <afa:ConnectRequest>
         <UserName>root</UserName>
         <Password>1qazXSW@</Password>
      </afa:ConnectRequest>
   </soapenv:Body>
</soapenv:Envelope>